GuidePromptTemplate = """
# 标题 xxxx
##  1. 问题概述
### 1.1 背景和适用场景
- 背景：xxxx
- 适用场景：xxxx

### 1.2 目标
xxxx

## 2. 所需工具和资源
- 上传文件信息：
    - @上传文件名称@：上传文件用途
    ……
- 知识库信息
    - @知识库名称@：知识库用途
    ……
- 工具信息
    - @工具名称@：工具用途
    ……

# 3. 步骤说明
## 3.1 步骤1：XX
#### 3.1.1 步骤概述
- 本步骤目标：xxxx
- 本步骤交付结果：XX 
- 依赖前序步骤：无
- 拆解为多个互不影响的子步骤执行：否
- 注意事项：无

#### 3.1.2 步骤详情
（1）xx  
（2）xx
……
#### 3.1.3 注意事项
- xxxx
……


## 3.2 步骤2：XX
#### 3.2.1 步骤概述
- 本步骤目标：xxxx
- 本步骤交付结果：XX 
- 依赖前序步骤：步骤 x
- 拆解为多个互不影响的子步骤执行：是
- 注意事项：无

#### 3.2.2 工作流程
（1）xx  
（2）xx
……
#### 3.2.3 注意事项
- xxxx
……


## 3.n 步骤n：最终交付与汇报
#### 3.3.1 步骤概述
- 本步骤目标：xx
- 本步骤交付结果：xx
- 依赖前序步骤：步骤x
- 拆解为多个互不影响的子步骤执行：否

#### 3.3.2 步骤详情
- 交付结果为：xx（明确最终的交付结果，如果是一份文件，需要明确给出文件完整路径；如果是对问题的回答，需要明确给出问题答案）。
"""