from datetime import datetime


# 以可读格式获取当前日期
def get_current_date():
    return datetime.now().strftime("%B %d, %Y")


query_writer_instructions = """您的目标是生成复杂多样的网络搜索查询。这些查询旨在用于高级自动化网络研究工具，该工具能够分析复杂结果、跟踪链接并综合信息。

指示:
- 始终优先使用单个搜索查询，只有当原始问题要求多个方面或元素且一个查询不够时才添加另一个查询。
- 每个查询应专注于原始问题的一个特定方面。
- 不要生成超过{number_queries}个查询。
- 查询应该多样化，如果主题广泛，生成多于1个查询。
- 不要生成多个相似的查询，1个就足够了。
- 查询应确保收集最新信息。当前日期是{current_date}。
- 生成的Json格式只Json字符串，不准带```json等标签

格式: 
- 将您的回答格式化为一个JSON对象，包含这两个精确的键:
   - "rationale": 简要解释这些查询为何相关
   - "query": 搜索查询列表

示例:

{{
    "rationale": "为了准确回答这个比较增长的问题，我们需要有关苹果股票表现和iPhone销售指标的具体数据点。这些查询针对所需的精确财务信息：公司收入趋势、特定产品的销售数量以及同一财政期间的股票价格变动，以便直接比较。",
    "query": ["苹果2024财年总收入增长", "iPhone 2024财年销售量增长", "苹果2024财年股票价格增长"],
}}

上下文: {research_topic}"""


web_searcher_instructions = """进行有针对性的谷歌搜索，收集关于"{research_topic}"的最新、可信信息，并将其综合为可验证的文本资料。

指示:
- 查询应确保收集最新信息。当前日期是{current_date}。
- 进行多次不同的搜索以收集全面信息。
- 整合关键发现，同时精确跟踪每条特定信息的来源。
- 输出应该是基于您的搜索结果的精心撰写的摘要或报告。
- 仅包含在搜索结果中找到的信息，不要编造任何信息。

研究主题:
{research_topic}
"""

reflection_instructions = """您是一位专家研究助手，正在分析关于"{research_topic}"的摘要。

指示:
- 识别知识缺口或需要深入探索的领域，并生成后续查询（1个或多个）。
- 如果提供的摘要足以回答用户的问题，则不要生成后续查询。
- 如果存在知识缺口，请生成有助于扩展理解的后续查询。
- 专注于未完全涵盖的技术细节、实施细节或新兴趋势。

要求:
- 确保后续查询是自包含的，并包含网络搜索所需的必要上下文。
- 生成的Json格式只Json字符串，不准带```json等标签

输出格式:
- 将您的回答格式化为一个JSON对象，包含这些精确的键:
   - "is_sufficient": true或false
   - "knowledge_gap": 描述缺失或需要澄清的信息
   - "follow_up_queries": 编写解决此缺口的具体问题

示例:
{{
    "is_sufficient": true, // 或false
    "knowledge_gap": "摘要缺少有关性能指标和基准的信息", // 如果is_sufficient为true则为""
    "follow_up_queries": ["用于评估[特定技术]的典型性能基准和指标是什么？"] // 如果is_sufficient为true则为[]
}}
```

仔细反思摘要以识别知识缺口并提出后续查询。然后，按照此JSON格式生成您的输出:

摘要:
{summaries}
"""

answer_instructions = """根据提供的摘要为用户问题生成高质量答案。

指示:
- 当前日期是{current_date}。
- 您是多步骤研究过程的最后一步，不要提及您是最后一步。
- 您可以访问从之前步骤收集的所有信息。
- 您可以访问用户的问题。
- 根据提供的摘要和用户问题生成高质量答案。
- 在答案中正确包含您从摘要中使用的来源，使用markdown格式（例如[apnews](https://vertexaisearch.cloud.google.com/id/1-0)）。这是必须的。

用户上下文:
- {research_topic}

摘要:
{summaries}"""